adlatus/adlatus-domain/src/test/resources/payloads/wita/v15/erlm/H_00854639_message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://wholesale.telekom.de/oss/v15/envelope" xmlns:message="http://wholesale.telekom.de/oss/v15/message">
    <soapenv:Header/>
    <soapenv:Body>
        <env:annehmenMeldungRequest>
            <control>
                <zeitstempel>2023-05-11T14:13:10.744+02:00</zeitstempel>
                <majorRelease>15</majorRelease>
                <minorRelease>10</minorRelease>
                <signaturId>
                    <issuer>EMAILADDRESS=wholesale-dialog@telekom.de, CN=ws-wholesale-portal.telekom.de, OU=Deutsche Telekom IT GmbH, O=Deutsche Telekom AG, L=Bonn, ST=NRW, C=DE</issuer>
                    <serial>cf3fc7a3d509abfd</serial>
                </signaturId>
            </control>
            <meldung>
                <auftragstyp>
                    <geschaeftsfall>NEU</geschaeftsfall>
                    <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                    <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
                </auftragstyp>
                <meldungstyp xsi:type="message:MeldungstypERLMType">
                    <meldungsattribute>
                        <vertragsnummer>3092482252</vertragsnummer>
                        <externeAuftragsnummer>H_00854639</externeAuftragsnummer>
                        <kundennummer>5920312290</kundennummer>
                        <erledigungstermin>2023-05-11+02:00</erledigungstermin>
                        <produktpositionen>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt xsi:type="message:ProduktXDSLMeldungType">
                                    <bezeichner>VDSL SA 100 Mbit/s</bezeichner>
                                </produkt>
                            </position>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt xsi:type="message:ProduktXDSLMeldungType">
                                    <bezeichner>Search Call</bezeichner>
                                </produkt>
                            </position>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt xsi:type="message:ProduktXDSLMeldungType">
                                    <bezeichner>Courtesy Call</bezeichner>
                                </produkt>
                            </position>
                        </produktpositionen>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0018</meldungscode>
                            <meldungstext>0A</meldungstext>
                        </position>
                        <position>
                            <meldungscode>0010</meldungscode>
                            <meldungstext>Auftrag ausgeführt.</meldungstext>
                        </position>
                    </meldungspositionen>
                </meldungstyp>
            </meldung>
        </env:annehmenMeldungRequest>
    </soapenv:Body>
</soapenv:Envelope>