adlatus/adlatus-domain/src/test/resources/payloads/wita/v15/H_00859616_message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="http://wholesale.telekom.de/oss/v15/envelope">
    <soapenv:Header/>
    <soapenv:Body>
        <env:annehmenAuftragRequest>
            <control>
                <zeitstempel>?</zeitstempel>
                <majorRelease>?</majorRelease>
                <minorRelease>?</minorRelease>
                <signaturId>
                    <issuer>?</issuer>
                    <serial>?</serial>
                </signaturId>
            </control>
            <auftrag>
                <externeAuftragsnummer>?</externeAuftragsnummer>
                <kunde>
                    <kundennummer>?</kundennummer>
                    <leistungsnummer>?</leistungsnummer>
                </kunde>
                <!--Optional:-->
                <besteller>
                    <kundennummer>?</kundennummer>
                    <leistungsnummer>?</leistungsnummer>
                </besteller>
                <geschaeftsfall/>
                <!--Optional:-->
                <kenner>
                    <!--Optional:-->
                    <ProjektID>
                        <!--Optional:-->
                        <projektkenner>?</projektkenner>
                        <!--Optional:-->
                        <kopplungskenner>?</kopplungskenner>
                    </ProjektID>
                    <!--Optional:-->
                    <Auftragskenner>
                        <auftragsklammer>?</auftragsklammer>
                        <anzahlAuftraege>?</anzahlAuftraege>
                    </Auftragskenner>
                </kenner>
            </auftrag>
        </env:annehmenAuftragRequest>
    </soapenv:Body>
</soapenv:Envelope>